Repository: RoyalTaxi/yalla-sdk-ios
Catalog: Sources/Resources/Resources/Localizable.xcstrings
Source language: uz_latn
Languages: en, ru, uz_cyrl

# language_title
source: Til
en: Language
ru: Язык
uz_cyrl: Тил

# onboarding_title
source: Xush kelibsiz
en: Welcome
ru: Добро пожаловать
uz_cyrl: Хуш келибсиз

# permission_title
source: Ruxsatlar
en: Permissions
ru: Разрешения
uz_cyrl: Рухсатлар

# menu_title
source: Menyu
en: Menu
ru: Меню
uz_cyrl: Меню

# home_title
source: Bosh sahifa
en: Home
ru: Главная
uz_cyrl: Бош саҳифа

# common_action_activate
source: Faollashtirish
en: Activate
ru: Активировать
uz_cyrl: Фаоллаштириш

# common_action_all
source: Barchasi
en: All
ru: Все
uz_cyrl: Барчаси

# common_action_allow
source: Ruxsat berish
en: Allow
ru: Разрешить
uz_cyrl: Рухсат бериш

# common_action_cancel
source: Bekor qilish
en: Cancel
ru: Отменить
uz_cyrl: Бекор қилиш

# common_action_confirm
source: Tasdiqlash
en: Confirm
ru: Подтвердить
uz_cyrl: Тасдиқлаш

# common_action_delete
source: O'chirish
en: Delete
ru: Удалить
uz_cyrl: Ўчириш

# common_action_edit
source: Tahrirlash
en: Edit
ru: Изменить
uz_cyrl: Таҳрирлаш

# common_action_next
source: Keyingi
en: Next
ru: Далее
uz_cyrl: Кейинги

# common_action_start
source: Boshlash
en: Get Started
ru: Начать
uz_cyrl: Бошлаш

# common_action_save
source: Saqlash
en: Save
ru: Сохранить
uz_cyrl: Сақлаш

# common_action_select
source: Tanlash
en: Select
ru: Выбрать
uz_cyrl: Танлаш

# common_action_send
source: Yuborish
en: Send
ru: Отправить
uz_cyrl: Юбориш

# common_action_skip
source: O'tkazib yuborish
en: Skip
ru: Пропустить
uz_cyrl: Ўтказиб юбориш

# common_action_use
source: Foydalanish
en: Use
ru: Использовать
uz_cyrl: Фойдаланиш

# common_status_loading
source: Yuklanmoqda
en: Loading
ru: Загрузка
uz_cyrl: Юкланмоқда

# common_status_ready
source: Tayyor
en: Ready
ru: Готово
uz_cyrl: Тайёр

# common_status_searching
source: Qidirilmoqda
en: Searching
ru: Поиск
uz_cyrl: Қидирилмоқда

# common_label_details
source: Tafsilotlar
en: Details
ru: Детали
uz_cyrl: Тафсилотлар

# common_label_status
source: Holat
en: Status
ru: Статус
uz_cyrl: Ҳолат

# format_currency_sum
source: %1$@ so'm
en: %1$@ sum
ru: %1$@ сум
uz_cyrl: %1$@ сўм

# format_currency_range
source: %1$@ dan %2$@ gacha
en: from %1$@ to %2$@
ru: от %1$@ до %2$@
uz_cyrl: %1$@ дан %2$@ гача

# format_time_min
source: %1$@ daq
en: %1$@ min
ru: %1$@ мин
uz_cyrl: %1$@ мин

# format_time_min_short
source: daq
en: min
ru: мин
uz_cyrl: дақ

# format_percent_up_to
source: %1$@%% gacha
en: Up to %1$@%%
ru: До %1$@%%
uz_cyrl: %1$@%% гача

# auth_login_title
source: Kirish
en: Login
ru: Вход
uz_cyrl: Кириш

# auth_welcome_title
source: Xush kelibsiz!
en: Welcome!
ru: Добро пожаловать!
uz_cyrl: Хуш келибсиз!

# auth_welcome_description
source: Davom etish uchun telefon raqamingizni kiriting.
en: Enter your phone number to continue.
ru: Введите номер телефона, чтобы продолжить.
uz_cyrl: Давом этиш учун телефон рақамингизни киритинг.

# auth_welcome_sms_hint
source: Raqamingizga tasdiqlash kodi bilan SMS yuboriladi.
en: A verification code will be sent to your number via SMS.
ru: На ваш номер будет отправлено SMS с кодом подтверждения.
uz_cyrl: Рақамингизга тасдиқлаш коди билан СМС юборилади.

# auth_privacy_policy_agreement
source: Davom etish orqali maxfiylik siyosatimiz bilan rozilik bildirasiz.
en: By continuing, you agree to our Privacy Policy.
ru: Продолжая, вы соглашаетесь с нашей политикой конфиденциальности.
uz_cyrl: Давом этиш орқали махфийлик сиёсатимиз билан розилик билдирасиз.

# auth_privacy_policy_link
source: maxfiylik siyosatimiz
en: Privacy Policy
ru: политикой конфиденциальности
uz_cyrl: махфийлик сиёсатимиз

# auth_otp_title
source: Xavfsizlik kodi
en: Security Code
ru: Код безопасности
uz_cyrl: Хавфсизлик коди

# auth_otp_description
source: Iltimos, +998%1$@ raqamiga yuborilgan %2$@ xonali kodni kiriting.
en: Enter the %2$@-digit code sent to +998%1$@.
ru: Введите %2$@-значный код, отправленный на номер +998%1$@.
uz_cyrl: Илтимос, +998%1$@ рақамига юборилган %2$@ хонали кодни киритинг.

# auth_otp_resend
source: Kodni qayta yuborish
en: Resend code
ru: Отправить код ещё раз
uz_cyrl: Кодни қайта юбориш

# auth_otp_resend_countdown
source: %1$@ soniyadan so'ng kodni qayta yuborish
en: Resend code in %1$@ seconds
ru: Отправить код ещё раз через %1$@ сек
uz_cyrl: %1$@ сониядан сўнг кодни қайта юбориш

# auth_required_title
source: Davom etish uchun hisobingizga kiring
en: Sign in to continue
ru: Для продолжения необходимо войти в аккаунт
uz_cyrl: Давом этиш учун ҳисобингизга киринг

# auth_required_description
source: Bu atigi bir necha daqiqa oladi
en: This will only take a few minutes
ru: Это займёт всего пару минут
uz_cyrl: Бу атиги бир неча дақиқа олади

# auth_required_action
source: Kirish
en: Sign In
ru: Войти
uz_cyrl: Кириш

# auth_send_code_error
source: Tasdiqlash kodini yuborib bo'lmadi
en: Failed to send verification code
ru: Не удалось отправить код подтверждения
uz_cyrl: Тасдиқлаш кодини юбориб бўлмади

# auth_validate_code_error
source: Tasdiqlash kodi noto'g'ri
en: Invalid verification code
ru: Неверный код подтверждения
uz_cyrl: Тасдиқлаш коди нотўғри

# register_title
source: Keling, tanishamiz
en: Let's get acquainted
ru: Давайте знакомиться
uz_cyrl: Келинг, танишамиз

# register_subtitle
source: Sizga qanday murojaat qilishim mumkin?
en: How should we address you?
ru: Как к вам обращаться?
uz_cyrl: Сизга қандай мурожаат қилишим мумкин?

# register_action
source: Ro'yxatdan o'tish
en: Register
ru: Зарегистрироваться
uz_cyrl: Рўйхатдан ўтиш

# register_input_name
source: Ismingizni kiriting
en: Enter your first name
ru: Введите имя
uz_cyrl: Исмингизни киритинг

# register_input_surname
source: Familiyangizni kiriting
en: Enter your last name
ru: Введите фамилию
uz_cyrl: Фамилиянгизни киритинг

# register_input_birthdate
source: Tug'ilgan sana
en: Date of birth
ru: Дата рождения
uz_cyrl: Туғилган сана

# register_gender_male
source: Erkak
en: Male
ru: Мужчина
uz_cyrl: Эркак

# register_gender_female
source: Ayol
en: Female
ru: Женщина
uz_cyrl: Аёл

# register_error
source: Ro'yxatdan o'tish muvaffaqiyatsiz yakunlandi
en: Registration failed
ru: Не удалось завершить регистрацию
uz_cyrl: Рўйхатдан ўтиш муваффақиятсиз якунланди

# profile_edit_title
source: Profilni tahrirlash
en: Edit Profile
ru: Редактировать профиль
uz_cyrl: Профилни таҳрирлаш

# profile_photo_change
source: Rasmni o'zgartirish
en: Change photo
ru: Изменить фото
uz_cyrl: Расмни ўзгартириш

# profile_photo_take
source: Suratga olish
en: Take photo
ru: Сделать фото
uz_cyrl: Суратга олиш

# profile_photo_gallery
source: Galereyadan tanlash
en: Choose from gallery
ru: Выбрать из галереи
uz_cyrl: Галереядан танлаш

# profile_photo_delete
source: Rasmni o'chirish
en: Delete photo
ru: Удалить фото
uz_cyrl: Расмни ўчириш

# profile_delete_title
source: Hisobni o'chirish
en: Delete Account
ru: Удалить аккаунт
uz_cyrl: Ҳисобни ўчириш

# profile_delete_confirm
source: Hisobingizni rostdan ham o'chirmoqchimisiz?
en: Are you sure you want to delete your account?
ru: Вы действительно хотите удалить свой аккаунт?
uz_cyrl: Ҳисобингизни ростдан ҳам ўчирмоқчимисиз?

# profile_delete_warning
source: Hisobingiz o'chirilgandan so'ng barcha ma'lumotlar butunlay yo'qoladi va qayta tiklanmaydi.
en: Once deleted, all your data will be permanently lost and cannot be recovered.
ru: После удаления все данные будут безвозвратно утеряны и не подлежат восстановлению.
uz_cyrl: Ҳисоб ўчирилгандан сўнг барча маълумотлар бутунлай йўқолади ва қайта тикланмайди.

# profile_delete_action
source: Ha, hisobni o'chirish
en: Yes, delete account
ru: Да, удалить аккаунт
uz_cyrl: Ҳа, ҳисобни ўчириш

# profile_logout_title
source: Hisobdan chiqish
en: Log Out
ru: Выйти из аккаунта
uz_cyrl: Ҳисобдан чиқиш

# profile_logout_confirm
source: Hisobdan rostdan ham chiqmoqchimisiz?
en: Are you sure you want to log out?
ru: Вы действительно хотите выйти?
uz_cyrl: Ҳисобдан чиқишни ростдан хоҳлайсизми?

# profile_logout_description
source: Chiqqaningizdan so'ng qaytadan hisobingizga kirishingiz mumkin
en: You can log back in anytime after signing out
ru: После выхода вы сможете войти снова в любое время
uz_cyrl: Чиққанингиздан сўнг қайтадан ҳисобингизга киришингиз мумкин

# profile_logout_action
source: Ha, hisobdan chiqish
en: Yes, log out
ru: Да, выйти
uz_cyrl: Ҳа, ҳисобдан чиқиш

# profile_update_success
source: Profil muvaffaqiyatli yangilandi
en: Profile updated successfully
ru: Профиль успешно обновлён
uz_cyrl: Профил муваффақиятли янгиланди

# profile_update_error
source: Profilni yangilab bo'lmadi
en: Failed to update profile
ru: Не удалось обновить профиль
uz_cyrl: Профилни янгилаб бўлмади

# profile_avatar_update_success
source: Profil rasmi muvaffaqiyatli yangilandi
en: Profile photo updated successfully
ru: Фото профиля успешно обновлено
uz_cyrl: Профил расми муваффақиятли янгиланди

# profile_avatar_update_error
source: Profil rasmini yangilab bo'lmadi
en: Failed to update profile photo
ru: Не удалось обновить фото профиля
uz_cyrl: Профил расмини янгилаб бўлмади

# profile_form_incomplete
source: Barcha maydonlarni to'ldiring
en: Please fill in all fields
ru: Заполните все поля
uz_cyrl: Барча майдонларни тўлдиринг

# intro_language_title
source: Ilova tilini tanlang
en: Select app language
ru: Выберите язык приложения
uz_cyrl: Илова тилини танланг

# intro_language_subtitle
source: Keyinroq Sozlamalarda oʻzgartirishingiz mumkin
en: You can change this later in Settings
ru: Вы сможете изменить это позже в настройках
uz_cyrl: Кейинроқ Созламаларда ўзгартиришингиз мумкин

# intro_location_title
source: Joylashuv
en: Location
ru: Местоположение
uz_cyrl: Жойлашув

# intro_location_description
source: Aniq buyurtma berish uchun joylashuvingizni ko'rsating.
en: Share your location for accurate ride requests.
ru: Укажите своё местоположение для точного оформления заказа.
uz_cyrl: Аниқ буюртма бериш учун жойлашувингизни кўрсатинг.

# location_gps_title
source: GPS-ni\nyoqing
en: Enable\nGPS
ru: Включите\nGPS
uz_cyrl: GPS-ни\nёқинг

# location_gps_subtitle
source: Sizning vaqtingiz — bizning tezligimiz
en: Your time — our speed
ru: Ваше время — наша скорость
uz_cyrl: Сизнинг вақтингиз — бизнинг тезлигимиз

# location_permission_title
source: Joylashuvni yoqing
en: Enable Location
ru: Включите местоположение
uz_cyrl: Жойлашувни ёқинг

# location_permission_description
source: Aniq chaqiruv uchun joylashuvingizni taqdim eting.
en: Share your location for accurate pickup.
ru: Отправьте своё местоположение для точной подачи.
uz_cyrl: Аниқ чақирув учун жойлашувингизни тақдим этинг.

# location_permission_action
source: Ruxsat berish
en: Allow
ru: Разрешить
uz_cyrl: Рухсат бериш

# intro_notification_title
source: Bildirishnomalar
en: Notifications
ru: Уведомления
uz_cyrl: Билдиришномалар

# intro_notification_description
source: Bildirishnomalar yuborish uchun ruxsat bering
en: Allow notifications to stay updated on your rides
ru: Разрешите отправку уведомлений
uz_cyrl: Билдиришномалар юбориш учун рухсат беринг

# intro_onboarding_1_title
source: Tez va qulay
en: Fast and Convenient
ru: Быстро и удобно
uz_cyrl: Тез ва қулай

# intro_onboarding_1_description
source: Safarni buyurtma qiling — Yalla bir necha soniyada eng yaqin haydovchini topadi.
en: Order a ride — Yalla finds the nearest driver in seconds.
ru: Закажите поездку — Yalla мгновенно найдёт ближайшего водителя.
uz_cyrl: Сафарни буюртма қилинг — Yalla бир неча сонияда энг яқин ҳайдовчини топади.

# intro_onboarding_2_title
source: Ishonchli haydovchilar
en: Trusted Drivers
ru: Надёжные водители
uz_cyrl: Ишончли ҳайдовчилар

# intro_onboarding_2_description
source: Yalladagi har bir haydovchi tekshiruvdan o'tgan va yuqori reytingga ega.
en: Every Yalla driver is verified and highly rated.
ru: Каждый водитель Yalla проверен и имеет высокий рейтинг.
uz_cyrl: Yallaдаги ҳар бир ҳайдовчи текширувдан ўтган ва юқори рейтингга эга.

# intro_onboarding_3_title
source: Shaffof narx
en: Transparent Pricing
ru: Прозрачная цена
uz_cyrl: Шаффоф нарх

# intro_onboarding_3_description
source: Safar boshlanishidan oldin narxni bilib oling — yashirin to'lovlar va kutilmagan xarajatlarsiz.
en: Know the cost before your trip — no hidden fees or surprises.
ru: Узнайте стоимость до начала поездки — без скрытых платежей и сюрпризов.
uz_cyrl: Сафар бошланишидан олдин нархни билиб олинг — яширин тўловлар ва кутилмаган харажатлар йўқ.

# intro_onboarding_4_title
source: Qulay to'lov
en: Easy Payment
ru: Удобная оплата
uz_cyrl: Қулай тўлов

# intro_onboarding_4_description
source: O'zingizga qulay usulda to'lang — karta yoki naqd pul bilan. Yalla bilan hammasi oson.
en: Pay your way — by card or cash. It's simple with Yalla.
ru: Платите, как удобно — картой или наличными. С Yalla всё просто.
uz_cyrl: Ўзингизга қулай усулда тўланг — карта ёки нақд пул билан. Yalla билан ҳаммаси осон.

# settings_title
source: Sozlamalar
en: Settings
ru: Настройки
uz_cyrl: Созламалар

# settings_language
source: Ilova tili
en: App Language
ru: Язык приложения
uz_cyrl: Илова тили

# settings_theme
source: Ilova mavzusi
en: App Theme
ru: Тема приложения
uz_cyrl: Илова мавзуси

# settings_theme_light
source: Yorug' mavzu
en: Light Mode
ru: Светлая тема
uz_cyrl: Ёруғ мавзу

# settings_theme_dark
source: Qorong'i mavzu
en: Dark Mode
ru: Тёмная тема
uz_cyrl: Тунги мавзу

# settings_theme_system
source: Tizim bo'yicha
en: System Default
ru: Системная
uz_cyrl: Тизим бўйича

# settings_map
source: Ilova xaritasi
en: App Map
ru: Карта приложения
uz_cyrl: Илова харитаси

# settings_map_google
source: Google xarita
en: Google Maps
ru: Google Карты
uz_cyrl: Google харита

# settings_map_libre
source: MapLibre xarita
en: MapLibre Maps
ru: MapLibre Карты
uz_cyrl: MapLibre харита

# places_title
source: Mening manzillarim
en: My Addresses
ru: Мои адреса
uz_cyrl: Менинг манзилларим

# places_add_hint
source: Tez buyurtma qilish uchun manzil qo'shing
en: Add an address for quick ordering
ru: Добавьте адрес для быстрого заказа
uz_cyrl: Тез буюртма қилиш учун манзил қўшинг

# places_type_home
source: Uy
en: Home
ru: Дом
uz_cyrl: Уй

# places_type_work
source: Ish
en: Work
ru: Работа
uz_cyrl: Иш

# places_type_office
source: Ofis
en: Office
ru: Офис
uz_cyrl: Офис

# places_type_other
source: Boshqa
en: Other
ru: Другое
uz_cyrl: Бошқа

# places_type_favorite
source: Sevimli
en: Favorite
ru: Избранное
uz_cyrl: Севимли

# places_form_new
source: Yangi manzil
en: New Address
ru: Новый адрес
uz_cyrl: Янги манзил

# places_form_edit
source: Manzilni tahrirlash
en: Edit Address
ru: Редактировать адрес
uz_cyrl: Манзилни таҳрирлаш

# places_form_address_hint
source: Manzilni kiriting
en: Enter address
ru: Введите адрес
uz_cyrl: Манзилни киритинг

# places_search_empty_hint
source: Manzilni qidiring
en: Search for an address
ru: Найдите адрес
uz_cyrl: Манзилни қидиринг

# places_form_name
source: Manzil nomi
en: Address name
ru: Название адреса
uz_cyrl: Манзил номи

# places_form_building
source: Uy raqami
en: Building number
ru: Номер дома
uz_cyrl: Уй рақами

# places_form_entrance
source: Kirish
en: Entrance
ru: Подъезд
uz_cyrl: Кириш

# places_form_comment
source: Izoh
en: Comment
ru: Комментарий
uz_cyrl: Изоҳ

# places_delete_title
source: Manzilni o'chirish
en: Delete Address
ru: Удалить адрес
uz_cyrl: Манзилни ўчириш

# places_delete_confirm
source: Ushbu manzilni rostdan ham o'chirmoqchimisiz?
en: Are you sure you want to delete this address?
ru: Вы уверены, что хотите удалить этот адрес?
uz_cyrl: Сиз ҳақиқатан ҳам ушбу манзилни ўчирмоқчимисиз?

# places_delete_warning
source: Manzil o'chirilgandan so'ng ma'lumotlarni tiklab bo'lmaydi
en: This action cannot be undone
ru: После удаления адрес нельзя будет восстановить
uz_cyrl: Манзил ўчирилгандан сўнг маълумотларни тиклаб бўлмайди

# places_delete_action
source: Ha, manzilni o'chirish
en: Yes, delete address
ru: Да, удалить адрес
uz_cyrl: Ҳа, манзилни ўчириш

# places_create_success
source: Manzil muvaffaqiyatli qo'shildi
en: Address added successfully
ru: Адрес успешно добавлен
uz_cyrl: Манзил муваффақиятли қўшилди

# places_create_error
source: Manzilni yaratib bo'lmadi
en: Failed to add address
ru: Не удалось добавить адрес
uz_cyrl: Манзилни яратиб бўлмади

# places_update_success
source: Manzil muvaffaqiyatli yangilandi
en: Address updated successfully
ru: Адрес успешно обновлён
uz_cyrl: Манзил муваффақиятли янгиланди

# places_update_error
source: Manzilni yangilab bo'lmadi
en: Failed to update address
ru: Не удалось обновить адрес
uz_cyrl: Манзилни янгилаб бўлмади

# places_delete_success
source: Manzil muvaffaqiyatli o'chirildi
en: Address deleted successfully
ru: Адрес успешно удалён
uz_cyrl: Манзил муваффақиятли ўчирилди

# places_delete_error
source: Manzilni o'chirib bo'lmadi
en: Failed to delete address
ru: Не удалось удалить адрес
uz_cyrl: Манзилни ўчириб бўлмади

# places_load_error
source: Manzillarni yuklab bo'lmadi
en: Failed to load addresses
ru: Не удалось загрузить адреса
uz_cyrl: Манзилларни юклаб бўлмади

# places_section_custom
source: Boshqa manzillar
en: Other addresses
ru: Другие адреса
uz_cyrl: Бошқа манзиллар

# payment_title
source: To'lov usuli
en: Payment Method
ru: Способ оплаты
uz_cyrl: Тўлов усули

# payment_section_cards
source: Kartalar va bonus
en: Cards and Bonus
ru: Карты и бонус
uz_cyrl: Карталар ва бонус

# payment_section_other
source: Boshqa usullar
en: Other Methods
ru: Другие способы
uz_cyrl: Бошқа усуллар

# payment_type_cash
source: Naqd pul
en: Cash
ru: Наличные
uz_cyrl: Нақд пул

# payment_type_card
source: Karta %1$@
en: Card %1$@
ru: Карта %1$@
uz_cyrl: Карта %1$@

# payment_card_list
source: Kartalar
en: Cards
ru: Карты
uz_cyrl: Карталар

# payment_card_new
source: Yangi karta
en: New Card
ru: Новая карта
uz_cyrl: Янги карта

# payment_card_add
source: Karta qo'shish
en: Add Card
ru: Добавить карту
uz_cyrl: Карта қўшиш

# payment_card_number
source: Karta raqami
en: Card number
ru: Номер карты
uz_cyrl: Карта рақами

# payment_card_delete
source: Kartani o'chirish
en: Delete Card
ru: Удалить карту
uz_cyrl: Картани ўчириш

# payment_card_delete_confirm
source: Kartangizni rostdan ham o'chirmoqchimisiz?
en: Are you sure you want to delete this card?
ru: Вы действительно хотите удалить эту карту?
uz_cyrl: Картангизни ростдан ҳам ўчирмоқчимисиз?

# payment_card_delete_warning
source: **** %1$@ kartasi o'chirilgandan keyin ma'lumotlarni qayta tiklab bo'lmaydi.
en: Card **** %1$@ will be permanently removed.
ru: После удаления карты **** %1$@ восстановить данные будет невозможно.
uz_cyrl: **** %1$@ картаси ўчирилгандан кейин маълумотларни қайта тиклаб бўлмайди.

# payment_card_add_success
source: Karta muvaffaqiyatli qo'shildi
en: Card added successfully
ru: Карта успешно добавлена
uz_cyrl: Карта муваффақиятли қўшилди

# payment_card_add_error
source: Noto'g'ri ma'lumot, qayta urinib ko'ring
en: Invalid card details, please try again
ru: Неверные данные, попробуйте ещё раз
uz_cyrl: Нотўғри маълумот, қайта уриниб кўринг

# payment_card_delete_success
source: Karta muvaffaqiyatli o'chirildi
en: Card deleted successfully
ru: Карта успешно удалена
uz_cyrl: Карта муваффақиятли ўчирилди

# payment_card_delete_error
source: Kartani o'chirish muvaffaqiyatsiz yakunlandi
en: Failed to delete card
ru: Не удалось удалить карту
uz_cyrl: Картани ўчириш муваффақиятсиз якунланди

# bonus_title
source: Bonuslar va chegirmalar
en: Bonuses and Discounts
ru: Бонусы и скидки
uz_cyrl: Бонуслар ва чегирмалар

# bonus_section_title
source: Bonuslar
en: Bonuses
ru: Бонусы
uz_cyrl: Бонуслар

# bonus_rate
source: 1 tanga = 1 so'm
en: 1 coin = 1 sum
ru: 1 монета = 1 сум
uz_cyrl: 1 танга = 1 сўм

# bonus_balance
source: Sizda %1$@ ball bor
en: You have %1$@ points
ru: У вас %1$@ баллов
uz_cyrl: Сизда %1$@ балл бор

# bonus_pay
source: Bonus bilan to'lash
en: Pay with bonus
ru: Оплатить бонусами
uz_cyrl: Бонус билан тўлаш

# bonus_pay_for_next_trip
source: Ekonom va Komfortda sayohat qiling — keyingi sayohatlar uchun bonuslar bilan to'lang.
en: Ride in Economy and Comfort — pay for your next trips with bonuses.
ru: Ездите в Эконом и Комфорт — оплачивайте следующие поездки бонусами.
uz_cyrl: Эконом ва Комфортда сафар қилинг — кейинги сафарлар учун бонуслар билан тўланг.

# bonus_amount
source: Bonus miqdori
en: Bonus amount
ru: Сумма бонуса
uz_cyrl: Бонус миқдори

# cashback
source: Keshbek
en: Cashback
ru: Кешбэк
uz_cyrl: Кешбек

# bonus_promocode_title
source: Promokod
en: Promo Code
ru: Промокод
uz_cyrl: Промокод

# bonus_promocode_enter
source: Promokodni kiriting
en: Enter promo code
ru: Введите промокод
uz_cyrl: Промокодни киритинг

# bonus_promocode_placeholder
source: Kodni kiriting
en: Enter code
ru: Введите код
uz_cyrl: Кодни киритинг

# bonus_promocode_hint
source: Chegirma keyingi safaringizda avtomatik qo'llanadi
en: Discount will be applied automatically on your next ride
ru: Скидка применится автоматически при следующей поездке
uz_cyrl: Чегирма кейинги сафарингизда автоматик қўлланади

# bonus_promocode_success
source: Promokod muvaffaqiyatli qo'llandi
en: Promo code applied successfully
ru: Промокод успешно применён
uz_cyrl: Промокод муваффақиятли қўлланди

# bonus_promocode_error
source: Bunday promokod mavjud emas
en: This promo code doesn't exist
ru: Такого промокода не существует
uz_cyrl: Бундай промокод мавжуд эмас

# order_destination_hint
source: Qayerga boramiz?
en: Where are you going?
ru: Куда поедем?
uz_cyrl: Қаерга борамиз?

# order_destination_short
source: Qayerga boramiz?
en: Where to?
ru: Куда поедем?
uz_cyrl: Қаерга борамиз?

# order_location_not_found
source: Biz bu manzilni topa olmadik.\nIltimos, qayta urinib ko'ring.
en: We couldn't find this address.\nPlease try again.
ru: Мы не нашли такой адрес.\nПожалуйста, попробуйте ещё раз.
uz_cyrl: Биз бу манзилни тополмадик.\nИлтимос, қайта уриниб кўринг.

# order_location_set_mark
source: Belgi qo'yish
en: Set location
ru: Поставить метку
uz_cyrl: Белги қўйиш

# order_location_not_supported
source: %1$@ taksi xizmati tomonidan qo'llab-quvvatlanmaydi
en: %1$@ is not supported by our taxi service
ru: %1$@ не поддерживается сервисом такси
uz_cyrl: %1$@ такси хизмати томонидан қўллаб-қувватланмайди

# order_stops_title
source: Bekatlar
en: Stops
ru: Остановки
uz_cyrl: Бекатлар

# order_stops_add
source: Bekat qo'shish
en: Add a stop
ru: Добавить остановку
uz_cyrl: Бекат қўшиш

# order_stops_count
source: %1$@ manzil
en: %1$@ destinations
ru: %1$@ адресов
uz_cyrl: %1$@ манзил

# order_comment_title
source: Haydovchiga izoh
en: Note for driver
ru: Комментарий водителю
uz_cyrl: Ҳайдовчига изоҳ

# order_comment_placeholder
source: Izoh kiriting
en: Enter your note
ru: Введите комментарий
uz_cyrl: Изоҳ киритинг

# order_action_submit
source: Buyurtma berish
en: Order
ru: Заказать
uz_cyrl: Буюртма бериш

# order_pickup_time
source: Kelish %1$@ daq
en: Pickup in %1$@ min
ru: Подача через %1$@ мин
uz_cyrl: Келиш %1$@ дақ

# order_services_unavailable
source: Tanlangan xizmatlar ushbu tarif uchun mavjud emas
en: Selected services are not available for this tariff
ru: Выбранные услуги недоступны для данного тарифа
uz_cyrl: Танланган хизматлар ушбу тариф учун мавжуд эмас

# order_status_searching
source: Qidirilmoqda
en: Searching
ru: Идёт поиск
uz_cyrl: Қидирилмоқда

# order_status_coming
source: Siz tomonga kelmoqda
en: On the way to you
ru: Едет к вам
uz_cyrl: Сиз томонга келмоқда

# order_status_by_instruction
source: Yo'nalish bo'ylab
en: By instruction
ru: По указанию
uz_cyrl: Йўналиш бўйлаб

# order_list_title
source: Sizning buyurtmalaringiz
en: Your Orders
ru: Ваши заказы
uz_cyrl: Сизнинг буюртмаларингиз

# order_search_cars_nearby
source: Sizga yaqin %1$@ ta mashina bor
en: %1$@ cars near you
ru: Рядом с вами %1$@ машин
uz_cyrl: Сизга яқин %1$@ та машина бор

# order_search_selecting
source: Mos keladiganlarni tanlaymiz
en: Selecting the best match
ru: Выбираем подходящие
uz_cyrl: Мос келадиганларни танлаймиз
